// PieceList.cs
// 
// 各パズルピースの形の情報を保存します
// 列挙体で制御するのでパズルピースの名前で呼び出すことができるようにしたいです
// 

using JetBrains.Annotations;
using UnityEngine;

public class PieceList : MonoBehaviour
{
    int[,] mino1 = new int[5, 5] {
            { 1, 0, 0, 0, 0 },  // ■□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 } };// □□□□□

    int[,] mino2_1 = new int[5, 5] {
            { 1, 1, 0, 0, 0 },  // ■■□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 } };// □□□□□
    int[,] mino2_2 = new int[5, 5] {
            { 1, 0, 0, 0, 0 },  // ■□□□□
            { 1, 0, 0, 0, 0 },  // ■□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 } };// □□□□□

    int[,] mino3_1 = new int[5, 5] {
            { 1, 1, 0, 0, 0 },  // ■■□□□
            { 1, 0, 0, 0, 0 },  // ■□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 } };// □□□□□
    int[,] mino3_2 = new int[5, 5] {
            { 1, 1, 0, 0, 0 },  // ■■□□□
            { 0, 1, 0, 0, 0 },  // □■□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 } };// □□□□□
    int[,] mino3_3 = new int[5, 5] {
            { 0, 1, 0, 0, 0 },  // □■□□□
            { 1, 1, 0, 0, 0 },  // ■■□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 } };// □□□□□
    int[,] mino3_4 = new int[5, 5] {
            { 1, 0, 0, 0, 0 },  // ■□□□□
            { 1, 1, 0, 0, 0 },  // ■■□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 } };// □□□□□

    int[,] mino4 = new int[5, 5] {
            { 1, 1, 0, 0, 0 },  // ■■□□□
            { 1, 1, 0, 0, 0 },  // ■■□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 } };// □□□□□

    int[,] mino5_1 = new int[5, 5] {
            { 1, 1, 1, 1, 1 },  // ■■■■■
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 } };// □□□□□
    int[,] mino5_2 = new int[5, 5] {
            { 1, 0, 0, 0, 0 },  // ■□□□□
            { 1, 0, 0, 0, 0 },  // ■□□□□
            { 1, 0, 0, 0, 0 },  // ■□□□□
            { 1, 0, 0, 0, 0 },  // ■□□□□
            { 1, 0, 0, 0, 0 } };// ■□□□□

    int[,] mino6_1 = new int[5, 5] {
            { 1, 1, 1, 0, 0 },  // ■■■□□
            { 1, 1, 1, 0, 0 },  // ■■■□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 } };// □□□□□
    int[,] mino6_2 = new int[5, 5] {
            { 1, 1, 0, 0, 0 },  // ■■□□□
            { 1, 1, 0, 0, 0 },  // ■■□□□
            { 1, 1, 0, 0, 0 },  // ■■□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 } };// □□□□□

    int[,] mino9 = new int[5, 5] {
            { 1, 1, 1, 0, 0 },  // ■■■□□
            { 1, 1, 1, 0, 0 },  // ■■■□□
            { 1, 1, 1, 0, 0 },  // ■■■□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 } };// □□□□□

    /// <summary>
    /// 引数として渡されたゲームオブジェクトのタグでパズルピースの形を返す
    /// </summary>
    /// <param name="inGameObject">パズルピースをGameObjectで入れてください</param>
    /// <returns>タグを参照してピースの形を二次元配列で返却</returns>
    public int[,] PieceShapes(GameObject inGameObject, int inz)
    {
        int[,] PieceShape = new int[5, 5] {
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 },  // □□□□□
            { 0, 0, 0, 0, 0 } };// □□□□□

        // 現在操作しているピースのタグ情報からピースの形を返却するために入れる
        switch (inGameObject.tag)
        {
            case "mino1":
                PieceShape = mino1;
                break;
            case "mino2":

                break;
            case "mino3":

                break;
            case "mino4":
                PieceShape = mino4;
                break;
            case "mino5":

                break;
            case "mino6":

                break;
            case "mino9":
                PieceShape = mino9;
                break;
            default:
                Debug.Log("タグが読み取れてない");
                break;
        }

        return PieceShape;
    }
}
